; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=250, out_folder=./training, instance_id=13, seed=2037, goal_proportion=0.03

(define (problem blocksworld-13)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 - object)
 (:init 
    (arm-empty)
    (clear b41)
    (on b41 b75)
    (on b75 b132)
    (on-table b132)
    (clear b239)
    (on b239 b78)
    (on b78 b48)
    (on-table b48)
    (clear b79)
    (on b79 b123)
    (on b123 b43)
    (on b43 b174)
    (on b174 b57)
    (on b57 b70)
    (on b70 b44)
    (on-table b44)
    (clear b121)
    (on-table b121)
    (clear b59)
    (on b59 b166)
    (on-table b166)
    (clear b88)
    (on b88 b211)
    (on b211 b223)
    (on b223 b127)
    (on-table b127)
    (clear b38)
    (on b38 b202)
    (on-table b202)
    (clear b234)
    (on-table b234)
    (clear b52)
    (on b52 b182)
    (on b182 b50)
    (on b50 b232)
    (on b232 b129)
    (on b129 b204)
    (on b204 b24)
    (on b24 b212)
    (on b212 b1)
    (on b1 b83)
    (on b83 b61)
    (on b61 b139)
    (on b139 b168)
    (on b168 b236)
    (on-table b236)
    (clear b240)
    (on b240 b126)
    (on b126 b37)
    (on b37 b29)
    (on b29 b84)
    (on b84 b32)
    (on b32 b145)
    (on-table b145)
    (clear b162)
    (on b162 b81)
    (on b81 b190)
    (on b190 b93)
    (on b93 b9)
    (on-table b9)
    (clear b74)
    (on-table b74)
    (clear b205)
    (on b205 b76)
    (on b76 b187)
    (on b187 b133)
    (on b133 b197)
    (on b197 b64)
    (on b64 b149)
    (on b149 b249)
    (on b249 b242)
    (on-table b242)
    (clear b36)
    (on-table b36)
    (clear b207)
    (on b207 b154)
    (on-table b154)
    (clear b178)
    (on b178 b49)
    (on b49 b209)
    (on b209 b159)
    (on b159 b89)
    (on b89 b156)
    (on b156 b183)
    (on b183 b144)
    (on b144 b96)
    (on b96 b248)
    (on b248 b92)
    (on b92 b33)
    (on b33 b231)
    (on b231 b243)
    (on-table b243)
    (clear b120)
    (on b120 b90)
    (on-table b90)
    (clear b3)
    (on b3 b114)
    (on b114 b151)
    (on b151 b181)
    (on b181 b98)
    (on b98 b108)
    (on-table b108)
    (clear b136)
    (on b136 b238)
    (on-table b238)
    (clear b67)
    (on-table b67)
    (clear b155)
    (on-table b155)
    (clear b21)
    (on b21 b109)
    (on b109 b51)
    (on b51 b107)
    (on b107 b138)
    (on-table b138)
    (clear b4)
    (on-table b4)
    (clear b40)
    (on b40 b214)
    (on-table b214)
    (clear b237)
    (on b237 b7)
    (on b7 b195)
    (on-table b195)
    (clear b224)
    (on-table b224)
    (clear b112)
    (on b112 b14)
    (on b14 b225)
    (on b225 b82)
    (on b82 b233)
    (on-table b233)
    (clear b171)
    (on-table b171)
    (clear b201)
    (on b201 b217)
    (on b217 b218)
    (on-table b218)
    (clear b6)
    (on-table b6)
    (clear b179)
    (on b179 b13)
    (on b13 b247)
    (on b247 b130)
    (on b130 b146)
    (on b146 b206)
    (on b206 b189)
    (on b189 b164)
    (on b164 b219)
    (on-table b219)
    (clear b246)
    (on-table b246)
    (clear b22)
    (on b22 b152)
    (on b152 b91)
    (on b91 b55)
    (on-table b55)
    (clear b8)
    (on b8 b250)
    (on b250 b10)
    (on b10 b180)
    (on b180 b222)
    (on-table b222)
    (clear b2)
    (on b2 b245)
    (on b245 b105)
    (on b105 b198)
    (on b198 b103)
    (on b103 b140)
    (on b140 b165)
    (on-table b165)
    (clear b101)
    (on b101 b71)
    (on-table b71)
    (clear b72)
    (on b72 b115)
    (on b115 b185)
    (on-table b185)
    (clear b192)
    (on b192 b188)
    (on b188 b35)
    (on b35 b85)
    (on b85 b119)
    (on b119 b200)
    (on b200 b213)
    (on b213 b244)
    (on-table b244)
    (clear b150)
    (on b150 b100)
    (on b100 b31)
    (on b31 b235)
    (on b235 b157)
    (on b157 b122)
    (on-table b122)
    (clear b60)
    (on b60 b53)
    (on b53 b58)
    (on b58 b16)
    (on b16 b169)
    (on b169 b5)
    (on b5 b193)
    (on b193 b20)
    (on-table b20)
    (clear b167)
    (on b167 b27)
    (on-table b27)
    (clear b54)
    (on-table b54)
    (clear b28)
    (on b28 b161)
    (on b161 b42)
    (on-table b42)
    (clear b142)
    (on b142 b30)
    (on b30 b116)
    (on b116 b73)
    (on b73 b18)
    (on b18 b135)
    (on b135 b111)
    (on b111 b128)
    (on b128 b173)
    (on b173 b46)
    (on b46 b147)
    (on b147 b63)
    (on-table b63)
    (clear b11)
    (on b11 b226)
    (on b226 b26)
    (on b26 b172)
    (on b172 b158)
    (on b158 b160)
    (on b160 b124)
    (on b124 b95)
    (on b95 b86)
    (on b86 b23)
    (on b23 b94)
    (on b94 b39)
    (on-table b39)
    (clear b229)
    (on b229 b104)
    (on b104 b176)
    (on b176 b153)
    (on b153 b175)
    (on b175 b113)
    (on b113 b137)
    (on-table b137)
    (clear b210)
    (on-table b210)
    (clear b19)
    (on b19 b131)
    (on b131 b62)
    (on b62 b47)
    (on b47 b170)
    (on b170 b102)
    (on b102 b221)
    (on b221 b99)
    (on b99 b87)
    (on b87 b125)
    (on b125 b56)
    (on b56 b163)
    (on b163 b186)
    (on b186 b227)
    (on b227 b215)
    (on b215 b17)
    (on b17 b141)
    (on-table b141)
    (clear b228)
    (on b228 b177)
    (on b177 b191)
    (on b191 b184)
    (on b184 b148)
    (on b148 b118)
    (on b118 b106)
    (on b106 b134)
    (on b134 b77)
    (on b77 b208)
    (on b208 b45)
    (on-table b45)
    (clear b68)
    (on b68 b199)
    (on b199 b196)
    (on b196 b110)
    (on b110 b69)
    (on b69 b203)
    (on b203 b65)
    (on b65 b230)
    (on-table b230)
    (clear b25)
    (on-table b25)
    (clear b97)
    (on-table b97)
    (clear b12)
    (on-table b12)
    (clear b34)
    (on b34 b241)
    (on b241 b117)
    (on b117 b80)
    (on b80 b15)
    (on b15 b220)
    (on-table b220)
    (clear b194)
    (on b194 b143)
    (on b143 b216)
    (on-table b216)
    (clear b66)
    (on-table b66))
 (:goal  (and 
    (clear b1)
    (on b1 b6)
    (on-table b6)
    (clear b4)
    (on b4 b3)
    (on b3 b2)
    (on b2 b5)
    (on b5 b7)
    (on-table b7))))

; plan
1. (unstack b237 b7)
   deleted: (on b237 b7) (clear b237) (arm-empty)
   added: (holding b237) (clear b7)
   goals met: 2 of 9
2. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 2 of 9
3. (unstack b7 b195)
   deleted: (on b7 b195) (clear b7) (arm-empty)
   added: (holding b7) (clear b195)
   goals met: 2 of 9
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 9
5. (unstack b52 b182)
   deleted: (on b52 b182) (clear b52) (arm-empty)
   added: (holding b52) (clear b182)
   goals met: 3 of 9
6. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 3 of 9
7. (unstack b182 b50)
   deleted: (on b182 b50) (clear b182) (arm-empty)
   added: (holding b182) (clear b50)
   goals met: 3 of 9
8. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 3 of 9
9. (unstack b50 b232)
   deleted: (on b50 b232) (clear b50) (arm-empty)
   added: (holding b50) (clear b232)
   goals met: 3 of 9
10. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 3 of 9
11. (unstack b232 b129)
   deleted: (on b232 b129) (clear b232) (arm-empty)
   added: (holding b232) (clear b129)
   goals met: 3 of 9
12. (putdown b232)
   deleted: (holding b232)
   added: (clear b232) (arm-empty) (on-table b232)
   goals met: 3 of 9
13. (unstack b129 b204)
   deleted: (on b129 b204) (clear b129) (arm-empty)
   added: (holding b129) (clear b204)
   goals met: 3 of 9
14. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 3 of 9
15. (unstack b204 b24)
   deleted: (on b204 b24) (clear b204) (arm-empty)
   added: (holding b204) (clear b24)
   goals met: 3 of 9
16. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 3 of 9
17. (unstack b24 b212)
   deleted: (on b24 b212) (clear b24) (arm-empty)
   added: (holding b24) (clear b212)
   goals met: 3 of 9
18. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 9
19. (unstack b212 b1)
   deleted: (on b212 b1) (clear b212) (arm-empty)
   added: (holding b212) (clear b1)
   goals met: 4 of 9
20. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 4 of 9
21. (unstack b60 b53)
   deleted: (on b60 b53) (clear b60) (arm-empty)
   added: (holding b60) (clear b53)
   goals met: 4 of 9
22. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 4 of 9
23. (unstack b53 b58)
   deleted: (on b53 b58) (clear b53) (arm-empty)
   added: (holding b53) (clear b58)
   goals met: 4 of 9
24. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 4 of 9
25. (unstack b58 b16)
   deleted: (on b58 b16) (clear b58) (arm-empty)
   added: (holding b58) (clear b16)
   goals met: 4 of 9
26. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 4 of 9
27. (unstack b16 b169)
   deleted: (on b16 b169) (clear b16) (arm-empty)
   added: (holding b16) (clear b169)
   goals met: 4 of 9
28. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 4 of 9
29. (unstack b169 b5)
   deleted: (on b169 b5) (clear b169) (arm-empty)
   added: (holding b169) (clear b5)
   goals met: 4 of 9
30. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 4 of 9
31. (unstack b2 b245)
   deleted: (on b2 b245) (clear b2) (arm-empty)
   added: (holding b2) (clear b245)
   goals met: 4 of 9
32. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 5 of 9
33. (unstack b3 b114)
   deleted: (on b3 b114) (clear b3) (arm-empty)
   added: (holding b3) (clear b114)
   goals met: 5 of 9
34. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 6 of 9
35. (unstack b1 b83)
   deleted: (on b1 b83) (clear b1) (arm-empty)
   added: (holding b1) (clear b83)
   goals met: 5 of 9
36. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 7 of 9
37. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 6 of 9
38. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 9
39. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 9
40. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 7 of 9
41. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 6 of 9
42. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 9
43. (unstack b5 b193)
   deleted: (on b5 b193) (clear b5) (arm-empty)
   added: (holding b5) (clear b193)
   goals met: 6 of 9
44. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 7 of 9
45. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 9
46. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 8 of 9
47. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 6 of 9
48. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 7 of 9
49. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 9
50. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 8 of 9
51. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 9
52. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 9 of 9
